ARMmbed/mbed-os/targets/TARGET_Atmel/TARGET_SAM_CortexM0P/utils/cmsis/TARGET_SAMR21/include/component/comp_rtc.h
#define RTC_READREQ_OFFSET          0x02         /**< \brief (RTC_READREQ offset) Read Request */
#define RTC_READREQ_RESETVALUE      0x0010ul     /**< \brief (RTC_READREQ reset_value) Read Request */

#define RTC_READREQ_ADDR_Pos        0            /**< \brief (RTC_READREQ) Address */
#define RTC_READREQ_ADDR_Msk        (0x3Ful << RTC_READREQ_ADDR_Pos)
#define RTC_READREQ_ADDR(value)     (RTC_READREQ_ADDR_Msk & ((value) << RTC_READREQ_ADDR_Pos))
#define RTC_READREQ_RCONT_Pos       14           /**< \brief (RTC_READREQ) Read Continuously */
#define RTC_READREQ_RCONT           (0x1ul << RTC_READREQ_RCONT_Pos)
#define RTC_READREQ_RREQ_Pos        15           /**< \brief (RTC_READREQ) Read Request */
#define RTC_READREQ_RREQ            (0x1ul << RTC_READREQ_RREQ_Pos)
#define RTC_READREQ_MASK            0xC03Ful     /**< \brief (RTC_READREQ) MASK Register */

/* -------- RTC_MODE0_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE0 MODE0 Event Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint16_t PEREO0: 1;        /*!< bit:      0  Periodic Interval 0 Event Output Enable */
        uint16_t PEREO1: 1;        /*!< bit:      1  Periodic Interval 1 Event Output Enable */
        uint16_t PEREO2: 1;        /*!< bit:      2  Periodic Interval 2 Event Output Enable */
        uint16_t PEREO3: 1;        /*!< bit:      3  Periodic Interval 3 Event Output Enable */
        uint16_t PEREO4: 1;        /*!< bit:      4  Periodic Interval 4 Event Output Enable */
        uint16_t PEREO5: 1;        /*!< bit:      5  Periodic Interval 5 Event Output Enable */
        uint16_t PEREO6: 1;        /*!< bit:      6  Periodic Interval 6 Event Output Enable */
        uint16_t PEREO7: 1;        /*!< bit:      7  Periodic Interval 7 Event Output Enable */
        uint16_t CMPEO0: 1;        /*!< bit:      8  Compare 0 Event Output Enable      */
        uint16_t : 6;              /*!< bit:  9..14  Reserved                           */
        uint16_t OVFEO: 1;         /*!< bit:     15  Overflow Event Output Enable       */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint16_t PEREO: 8;         /*!< bit:  0.. 7  Periodic Interval x Event Output Enable */
        uint16_t CMPEO: 1;         /*!< bit:      8  Compare x Event Output Enable      */
        uint16_t : 7;              /*!< bit:  9..15  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint16_t reg;                /*!< Type      used for register access              */
} RTC_MODE0_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_MODE0_EVCTRL_OFFSET     0x04         /**< \brief (RTC_MODE0_EVCTRL offset) MODE0 Event Control */
#define RTC_MODE0_EVCTRL_RESETVALUE 0x0000ul     /**< \brief (RTC_MODE0_EVCTRL reset_value) MODE0 Event Control */

#define RTC_MODE0_EVCTRL_PEREO0_Pos 0            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval 0 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO0     (1 << RTC_MODE0_EVCTRL_PEREO0_Pos)
#define RTC_MODE0_EVCTRL_PEREO1_Pos 1            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval 1 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO1     (1 << RTC_MODE0_EVCTRL_PEREO1_Pos)
#define RTC_MODE0_EVCTRL_PEREO2_Pos 2            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval 2 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO2     (1 << RTC_MODE0_EVCTRL_PEREO2_Pos)
#define RTC_MODE0_EVCTRL_PEREO3_Pos 3            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval 3 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO3     (1 << RTC_MODE0_EVCTRL_PEREO3_Pos)
#define RTC_MODE0_EVCTRL_PEREO4_Pos 4            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval 4 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO4     (1 << RTC_MODE0_EVCTRL_PEREO4_Pos)
#define RTC_MODE0_EVCTRL_PEREO5_Pos 5            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval 5 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO5     (1 << RTC_MODE0_EVCTRL_PEREO5_Pos)
#define RTC_MODE0_EVCTRL_PEREO6_Pos 6            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval 6 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO6     (1 << RTC_MODE0_EVCTRL_PEREO6_Pos)
#define RTC_MODE0_EVCTRL_PEREO7_Pos 7            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval 7 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO7     (1 << RTC_MODE0_EVCTRL_PEREO7_Pos)
#define RTC_MODE0_EVCTRL_PEREO_Pos  0            /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval x Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO_Msk  (0xFFul << RTC_MODE0_EVCTRL_PEREO_Pos)
#define RTC_MODE0_EVCTRL_PEREO(value) (RTC_MODE0_EVCTRL_PEREO_Msk & ((value) << RTC_MODE0_EVCTRL_PEREO_Pos))
#define RTC_MODE0_EVCTRL_CMPEO0_Pos 8            /**< \brief (RTC_MODE0_EVCTRL) Compare 0 Event Output Enable */
#define RTC_MODE0_EVCTRL_CMPEO0     (1 << RTC_MODE0_EVCTRL_CMPEO0_Pos)
#define RTC_MODE0_EVCTRL_CMPEO_Pos  8            /**< \brief (RTC_MODE0_EVCTRL) Compare x Event Output Enable */
#define RTC_MODE0_EVCTRL_CMPEO_Msk  (0x1ul << RTC_MODE0_EVCTRL_CMPEO_Pos)
#define RTC_MODE0_EVCTRL_CMPEO(value) (RTC_MODE0_EVCTRL_CMPEO_Msk & ((value) << RTC_MODE0_EVCTRL_CMPEO_Pos))
#define RTC_MODE0_EVCTRL_OVFEO_Pos  15           /**< \brief (RTC_MODE0_EVCTRL) Overflow Event Output Enable */
#define RTC_MODE0_EVCTRL_OVFEO      (0x1ul << RTC_MODE0_EVCTRL_OVFEO_Pos)
#define RTC_MODE0_EVCTRL_MASK       0x81FFul     /**< \brief (RTC_MODE0_EVCTRL) MASK Register */

/* -------- RTC_MODE1_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE1 MODE1 Event Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint16_t PEREO0: 1;        /*!< bit:      0  Periodic Interval 0 Event Output Enable */
        uint16_t PEREO1: 1;        /*!< bit:      1  Periodic Interval 1 Event Output Enable */
        uint16_t PEREO2: 1;        /*!< bit:      2  Periodic Interval 2 Event Output Enable */
        uint16_t PEREO3: 1;        /*!< bit:      3  Periodic Interval 3 Event Output Enable */
        uint16_t PEREO4: 1;        /*!< bit:      4  Periodic Interval 4 Event Output Enable */
        uint16_t PEREO5: 1;        /*!< bit:      5  Periodic Interval 5 Event Output Enable */
        uint16_t PEREO6: 1;        /*!< bit:      6  Periodic Interval 6 Event Output Enable */
        uint16_t PEREO7: 1;        /*!< bit:      7  Periodic Interval 7 Event Output Enable */
        uint16_t CMPEO0: 1;        /*!< bit:      8  Compare 0 Event Output Enable      */
        uint16_t CMPEO1: 1;        /*!< bit:      9  Compare 1 Event Output Enable      */
        uint16_t : 5;              /*!< bit: 10..14  Reserved                           */
        uint16_t OVFEO: 1;         /*!< bit:     15  Overflow Event Output Enable       */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint16_t PEREO: 8;         /*!< bit:  0.. 7  Periodic Interval x Event Output Enable */
        uint16_t CMPEO: 2;         /*!< bit:  8.. 9  Compare x Event Output Enable      */
        uint16_t : 6;              /*!< bit: 10..15  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint16_t reg;                /*!< Type      used for register access              */
} RTC_MODE1_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

